# CdPerMSup2 Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
SymbolTypeId..::..CdPerMSup2 Property
SymbolTypeId Class See Also
---
Symbol cd/m², indicating unit Candelas per square meter.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2021
# Syntax
C#
---
```text
public static ForgeTypeId CdPerMSup2 { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property CdPerMSup2 As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ CdPerMSup2 {
	ForgeTypeId^ get ();
}
```

# See Also
SymbolTypeId Class
Autodesk.Revit.DB Namespace